app/controllers/atmcontroller_controller.rb

    def index
        @atminfos=Atminfo.all
---
SELECT "atminfos".* FROM "atminfos"