app/controllers/cinfra_view_controller.rb

SELECT "cinfras".* FROM "cinfras"
---
    def index
        @cinfras=Cinfra.all

INSERT INTO "cinfras" ("item_name", "quantity", "manufacturer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_name", "Table"], ["quantity", 10], ["manufacturer", "GreenPly"], ["created_at", "2018-10-01 10:42:22.580639"], ["updated_at", "2018-10-01 10:42:22.580639"]]
---
    def create
        cf1=Cinfra.new
        cf1.item_name=params[:values][:item_name]
        cf1.quantity=params[:values][:quantity]
        cf1.manufacturer=params[:values][:manufacturer]

        if cf1.save

SELECT  "cinfras".* FROM "cinfras" WHERE "cinfras"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @finder=Cinfra.find(params[:id])

DELETE FROM "cinfras" WHERE "cinfras"."id" = ?  [["id", 6]]
SELECT  "cinfras".* FROM "cinfras" WHERE "cinfras"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def delete
        @deleter=Cinfra.find(params[:id]).delete